In [1]:
import pandas as pd

# DataFrame
- 2차원 배열
- 행과 열로 구성

In [2]:
# Dictionary를 이용한 DataFrame생성
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [3]:
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

---
# 행 이름 바꾸기

In [4]:
# list를 이용한 DataFrame 생성
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서',"예은"],
    columns=["나이",'성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [6]:
# 행과 열 이름 변경하기
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [7]:
# 행 인덱스, 열 이름 변경하기 -1
df.index = ['학생1', '학생2']
df.columns = ['연령','남녀','소속']
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

---
- df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기

In [8]:
df = pd.DataFrame(
    [[15, '남', '덕영중'],
    [17, '여', '수리중']],
    index=['준서',"예은"],
    columns=["나이",'성별','학교']
)
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [10]:
df.rename(columns={'나이' : '연령','성별':'남녀','학교':'소속'}, inplace=True)
df
#inplace=True : 바로 적용

    연령 남녀   소속
준서  15  남  덕영중
예은  17  여  수리중

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [14]:
df = pd.DataFrame(
    [[90,98,85,100],
    [80,89,95,90],
    [70,95,100,90]],
    index= ['서준','우현','인아'],
    columns=['수학','영어','음악','체육']
)
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [15]:
dict = {'수학':[90,80,70],'영어':[98,89,95],'음악':[85,95,100],'체육':[100,90,90]}
dict

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [17]:
dict1=pd.DataFrame(dict)
dict1

   수학  영어   음악   체육
0  90  98   85  100
1  80  89   95   90
2  70  95  100   90

---
### 행삭제

In [18]:
df2 = df.copy()

In [19]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [20]:
# df2의 index가 우연히 1개행을 삭제
df2.drop('우현', inplace=True)

In [21]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [28]:
df4 = df.copy()

In [29]:
df4

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [30]:
df4.drop('우현', axis=0, inplace=True)

In [31]:
df4

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [37]:
df3 = df.copy()

In [38]:
df3

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [39]:
# df3의 index가 우현과 인아의 2개 행을 삭제
df3.drop(['우현','인아'],axis=0, inplace=True) #axis="rows" 가능

In [40]:
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [42]:
df5 = df.copy()

In [43]:
df5

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [44]:
# df5의 수학 1개 열을 삭제
df5.drop('수학', axis=1,inplace=True) #axis="columns" 가능

In [45]:
df5

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

In [46]:
df6 = df.copy()
df6

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [47]:
# df6 영어,음악 열 삭제
df6.drop(['영어','음악'], axis= "columns", inplace =True)
df6

    수학   체육
서준  90  100
우현  80   90
인아  70   90